app/controllers/api/api_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "omar"], ["LIMIT", 1]]
---
    def authenticate
      authenticate_or_request_with_http_basic do |email, password|
        Rails.logger.info "API authentication:#{email} #{password}"
        user = User.find_by(email: email)