app/controllers/api/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
---
  def get_article
    if !current_user.admin?
      @article = current_user.articles.find(params[:id])
    else
      @article=Article.find(params[:id])

SELECT "articles".* FROM "articles"
---
  def index
    if !current_user.admin?
      articles = current_user.articles

    else

      articles=Article.all

INSERT INTO "article_categories" ("article_id", "category_id") VALUES (?, ?)  [["article_id", 47], ["category_id", 2]]
INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    article=current_user.articles.new(article_params)
    article.user = current_user
    article.categories = set_categories

    if article.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_categories

    params[:category_ids].map {|x| Category.find(x) }