app/controllers/articles_controller.rb

  def create

    @article = Article.new(article_params)
    @article.user = current_user

    if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Testfd"], ["created_at", "2018-03-22 16:48:11.385071"], ["updated_at", "2018-03-22 16:48:11.385071"], ["description", "fehgoekgplke"], ["user_id", 5]]