app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "This is a title"], ["created_at", "2018-04-08 20:26:02.966635"], ["updated_at", "2018-04-08 20:26:02.966635"], ["description", "This is the body from a CSV"], ["user_id", 1]]
---
  def import

    CSV.foreach(params[:file].path, headers: true) do |row|
      puts row.to_hash
      @article=Article.new(row.to_hash)
      @article.user = current_user
      @article.save