app/controllers/csv_importer_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "the tr"], ["created_at", "2018-04-11 22:14:46.284833"], ["updated_at", "2018-04-11 22:14:46.284833"], ["description", "This is description 1 from csv importer"], ["user_id", 1]]
---
  def import


    CSV.foreach(params[:file].path, headers: true) do |row|
      puts '------------------------------'

      puts row.to_hash
      puts '------------------------------'
      @article=Article.new(row.to_hash)
      @article.user = current_user
      if @article.save